docs/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-02-07 Wed 13:25 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=1024, initial-scale=1" />
<title>Classpad II Stuff</title>
<meta name="author" content="Mitch Richling" />
<meta name="description" content="Some Random Stuff For Classpad II" />
<meta name="keywords" content="Casio" />
<meta name="generator" content="Org Mode" />
















</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://github.com/richmit/classpad2"> UP </a>
 |
 <a accesskey="H" href="https://www.mitchr.me/"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Classpad II Stuff</h1>
<table border="2 solid #ccc" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" align="center">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right"><b>Author:</b></td>
<td class="org-left"><i>Mitch Richling</i></td>
</tr>

<tr>
<td class="org-right"><b>Updated:</b></td>
<td class="org-left"><i>2024-02-07 13:25:51</i></td>
</tr>

<tr>
<td class="org-right"><b>Generated:</b></td>
<td class="org-left"><i>2024-02-07 13:25:53</i></td>
</tr>
</tbody>
</table>
<p align="center">
Copyright &copy; 2024 Mitch Richling. All rights reserved.
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#introduction">1. Introduction</a></li>
<li><a href="#orgd1fe252">2. Library Functions</a>
<ul>
<li><a href="#mjrCAS">2.1. CAS Stuff (<code>mjrLib/mjrCAS</code>)</a></li>
<li><a href="#mjrConstants">2.2. Physical Constants (<code>mjrLib/mjrConstants</code>)</a></li>
<li><a href="#mjrIntegers">2.3. Integer Stuff (<code>mjrLib/mjrIntegers</code>)</a></li>
<li><a href="#mjrLinearAlg">2.4. Linear Algebra (<code>mjrLib/mjrLinearAlg</code>)</a></li>
<li><a href="#mjrMiscMath">2.5. Misc Math (<code>mjrLib/mjrMiscMath</code>)</a></li>
<li><a href="#mjrPolynomial">2.6. Polynomial Stuff (<code>mjrLib/mjrPolynomial</code>)</a></li>
<li><a href="#mjrRepMeas">2.7. Repeated Measurement (<code>mjrLib/mjrRepMeas</code>)</a></li>
<li><a href="#mjrTrig">2.8. Trig Functions (<code>mjrLib/mjrTrig</code>)</a></li>
<li><a href="#mjrUnits">2.9. Units Functions (<code>mjrLib/mjrUnits</code>)</a></li>
</ul>
</li>
<li><a href="#mjrProg">3. Programs (<code>mjrProg/</code>)</a></li>
<li><a href="#mjrComp">4. Computational eActivities (<code>mjrComp/</code>)</a></li>
<li><a href="#org41f59f0">5. Formulas &amp; Equations eActivities (<code>mjrEqn/</code>)</a></li>
</ul>
</div>
</div>

<div id="outline-container-introduction" class="outline-2">
<h2 id="introduction"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-introduction">
<p>
Just some stuff I've written for the Casio Classpad II calculator.
</p>

<p>
All of the programs mentioned here may be foudn on github:
<a href="https://github.com/richmit/classpad2">https://github.com/richmit/classpad2</a>
</p>
</div>
</div>

<div id="outline-container-orgd1fe252" class="outline-2">
<h2 id="orgd1fe252"><span class="section-number-2">2.</span> Library Functions</h2>
<div class="outline-text-2" id="text-2">
<p>
Functions intended to be placed in the <code>Library</code> folder.  The
functions are contained inside eActivities so that one may pick and
choose which functions they wish to have defined &#x2013; simply open the
function strip, and evaluate the lines with the functions desired.
</p>
</div>

<div id="outline-container-mjrCAS" class="outline-3">
<h3 id="mjrCAS"><span class="section-number-3">2.1.</span> CAS Stuff (<code>mjrLib/mjrCAS</code>)</h3>
<div class="outline-text-3" id="text-mjrCAS">
<p>
Just a couple simple algebraic manipulation short cuts.  
</p>

<ul class="org-ul">
<li><b><code>tbmxs</code></b>: Multiply top &amp; bottom of a fraction by a factor.  The top &amp; bottom are then separately expanded and simplified twice.</li>
<li><b><code>xxs</code></b>: Expand, Expand, Simplify</li>
</ul>
</div>
</div>

<div id="outline-container-mjrConstants" class="outline-3">
<h3 id="mjrConstants"><span class="section-number-3">2.2.</span> Physical Constants (<code>mjrLib/mjrConstants</code>)</h3>
<div class="outline-text-3" id="text-mjrConstants">
<p>
All physical constants functions take the number of significant digits
requested. A \(0\) means to return all available digits.  All of these are
from the 2018 NIST standard values.  Note many constants are defined
in Casio's <code>Physium</code> application &#x2013; I just like to have these
available in the keyboard function catalog because I use them quite
frequently.
</p>

<p>
Note: These all start with <code>c_</code> so they show up clumped together in
the keyboard function catalog.
</p>

<ul class="org-ul">
<li><b><code>c_c0</code></b>: Speed of light (299792458)</li>
<li><b><code>c_g</code></b>: Standard acceleration of gravity (9.80665)</li>
<li><b><code>c_G</code></b>: Newtonian constant of gravitation (6.67430e-11)</li>
<li><b><code>c_atm</code></b>: Standard atmospheric pressure (101325)</li>
<li><b><code>c_avogadro</code></b>: Avogadro constant (6.02214076e23)</li>
</ul>
</div>
</div>

<div id="outline-container-mjrIntegers" class="outline-3">
<h3 id="mjrIntegers"><span class="section-number-3">2.3.</span> Integer Stuff (<code>mjrLib/mjrIntegers</code>)</h3>
<div class="outline-text-3" id="text-mjrIntegers">
<p>
Most of these functions accept &amp; return non-negative integers.  The
idea is to be able to perform bit manipulation operations on regular
integers.  We can provide binary-like input and output from these
functions with the <code>bitI</code> and <code>bitO</code> functions.  It's no HP-16C, but
it will work in a pinch.
</p>

<ul class="org-ul">
<li>General Integer Stuff
<ul class="org-ul">
<li><b><code>oddp</code></b>: 1 if odd, 0 if even</li>
<li><b><code>evenp</code></b>: 1 if even, 0 if odd</li>
</ul></li>
<li>Interpreting decimal integers as binary and vice versa
<ul class="org-ul">
<li><b><code>bitI</code></b>: dec interpreted as bin</li>
<li><b><code>bitO</code></b>: bin interpreted as dec</li>
</ul></li>
<li>Bit Shifting
<ul class="org-ul">
<li><b><code>bitSR</code></b>: Shift right 1 bit</li>
<li><b><code>bitSRn</code></b>: Shift right n bits</li>
<li><b><code>bitSL</code></b>: Shift left 1 bit</li>
<li><b><code>bitSLn</code></b>: Shift left n bits</li>
</ul></li>
<li>Bit Counting
<ul class="org-ul">
<li><b><code>intLog2</code></b>: int of base 2 log</li>
<li><b><code>bitSIZE</code></b>: bits required</li>
<li><b><code>bitCNT</code></b>: Number of set bits</li>
<li><b><code>bitCLZ</code></b>: Number of left zeros</li>
</ul></li>
<li>Binary Bitwise logical operations on fixed sized integers
<ul class="org-ul">
<li><b><code>bitANDn</code></b>: N bit, bitwise and</li>
<li><b><code>bitXORn</code></b>: N bit, bitwise xor</li>
<li><b><code>bitORn</code></b>: N bit, bitwise or</li>
</ul></li>
<li>Binary Bitwise logical operations
<ul class="org-ul">
<li><b><code>bitAND</code></b>: bitwise and</li>
<li><b><code>bitXOR</code></b>: bitwise xor</li>
<li><b><code>bitOR</code></b>: bitwise or</li>
</ul></li>
<li>Bitwise logical negation (this function only exists in a fixed sized form)
<ul class="org-ul">
<li><b><code>bitNOTn</code></b>: N bit, bitwise not</li>
</ul></li>
<li>Lists of Bits (utility functions used behind the scenes)
<ul class="org-ul">
<li><b><code>bitLIST</code></b>: Reverse list of bits</li>
<li><b><code>bitLISTn</code></b>: Reverse list N bits</li>
<li><b><code>bitULIST</code></b>: Bit list to number</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-mjrLinearAlg" class="outline-3">
<h3 id="mjrLinearAlg"><span class="section-number-3">2.4.</span> Linear Algebra (<code>mjrLib/mjrLinearAlg</code>)</h3>
<div class="outline-text-3" id="text-mjrLinearAlg">
<ul class="org-ul">
<li><b><code>diagR</code></b>: Diagonal for matrix (Matrix need not be square)</li>
<li><b><code>dprod</code></b>: Product of diagonal (Matrix need not be square)</li>
<li><b><code>dsum</code></b>: Diagonal Sum or trace  (Matrix need not be square)</li>
<li><b><code>slvSys</code></b>: Solve matrix equation</li>
<li><b><code>augRREF</code></b>: Augment to matrices together and RREF</li>
<li><b><code>invLeft</code></b>: Left inverse</li>
<li><b><code>invRight</code></b>: Right inverse</li>
<li><b><code>LU2P</code></b>: Return the value of \(P\) given \(M\), \(L\), &amp; \(U\)</li>
<li><b><code>cPolyS</code></b>: Characteristic polynomial via symbolic derivative</li>
<li><b><code>cPolyN</code></b>: Characteristic polynomial via polynomial interpolation</li>
</ul>
</div>
</div>

<div id="outline-container-mjrMiscMath" class="outline-3">
<h3 id="mjrMiscMath"><span class="section-number-3">2.5.</span> Misc Math (<code>mjrLib/mjrMiscMath</code>)</h3>
<div class="outline-text-3" id="text-mjrMiscMath">
<ul class="org-ul">
<li><b><code>pt2ln</code></b>: eq of line given 2 points (points provided as row vectors)</li>
<li><b><code>pt2ray</code></b>: eq of ray given 2 points (points provided as row vectors)</li>
</ul>
</div>
</div>

<div id="outline-container-mjrPolynomial" class="outline-3">
<h3 id="mjrPolynomial"><span class="section-number-3">2.6.</span> Polynomial Stuff (<code>mjrLib/mjrPolynomial</code>)</h3>
<div class="outline-text-3" id="text-mjrPolynomial">
<ul class="org-ul">
<li><b><code>rt2ply</code></b>: poly with given roots</li>
<li><b><code>rt2plym</code></b>: like rt2ply but monic</li>
<li><b><code>slvPly</code></b>: solve poly numerically</li>
<li><b><code>compMtrx</code></b>: Companion matrix</li>
</ul>
</div>
</div>

<div id="outline-container-mjrRepMeas" class="outline-3">
<h3 id="mjrRepMeas"><span class="section-number-3">2.7.</span> Repeated Measurement (<code>mjrLib/mjrRepMeas</code>)</h3>
<div class="outline-text-3" id="text-mjrRepMeas">
<p>
I have a much more sophsticated solution for the HP-42S calculator: <a href="https://richmit.github.io/hp42/meas.html">https://richmit.github.io/hp42/meas.html</a>
</p>

<ul class="org-ul">
<li>Mean &amp; Standard Deviation
<ul class="org-ul">
<li><b><code>repMesNS</code></b>: Meas Stats (μ &amp; σ)</li>
<li><b><code>repMesNI</code></b>: Meas Interval (μ±σ)</li>
</ul></li>
<li>Median &amp; Interquartile Range
<ul class="org-ul">
<li><b><code>repMesMS</code></b>: Meas Stats</li>
<li><b><code>repMesMI</code></b>: Meas Interval</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-mjrTrig" class="outline-3">
<h3 id="mjrTrig"><span class="section-number-3">2.8.</span> Trig Functions (<code>mjrLib/mjrTrig</code>)</h3>
<div class="outline-text-3" id="text-mjrTrig">
<ul class="org-ul">
<li><b><code>csc</code></b>: cosecant</li>
<li><b><code>sec</code></b>: secant</li>
<li><b><code>cot</code></b>: cotangent</li>
<li><b><code>havers</code></b>:  haversine: \(\frac{1-\cos(x)}{2}\)</li>
<li><b><code>cis</code></b>: Cosine-I-Sine: \(\cos(x)+i\cdot\sin(x)\)</li>
</ul>
</div>
</div>

<div id="outline-container-mjrUnits" class="outline-3">
<h3 id="mjrUnits"><span class="section-number-3">2.9.</span> Units Functions (<code>mjrLib/mjrUnits</code>)</h3>
<div class="outline-text-3" id="text-mjrUnits">
<p>
Note: These all start with <code>u_</code> so they show up clumped together in
the keyboard function catalog.
</p>

<ul class="org-ul">
<li>Units (volume)
<ul class="org-ul">
<li><b><code>u_gal_L</code></b>: US Gallons to liters (A US gallon is about 0.83267 Imperial gallon)</li>
<li><b><code>u_L_gal</code></b>: liters to US Gallons</li>
</ul></li>
<li>Units (force)
<ul class="org-ul">
<li><b><code>u_lb_kgf</code></b>: US Pounds to kg force</li>
<li><b><code>u_kgf_lb</code></b>: kg force to US pounds</li>
<li><b><code>u_N_lb</code></b>: Newtons to US pounds</li>
<li><b><code>u_lb_N</code></b>: US Pounds to newtons</li>
</ul></li>
<li>Units (temp)
<ul class="org-ul">
<li><b><code>u_F_C</code></b>: Degrees Fahrenheit to Celsius</li>
<li><b><code>u_C_F</code></b>: Degrees Celsius to Fahrenheit</li>
<li><b><code>u_K_C</code></b>: Degrees Kelvin to Celsius</li>
<li><b><code>u_C_K</code></b>: Degrees Celsius to Kelvin</li>
</ul></li>
<li>Units (length)
<ul class="org-ul">
<li><b><code>u_in_cm</code></b>: International inches to centimeters (2.54 inches to the centimeter)</li>
<li><b><code>u_cm_in</code></b>: Centimeters to international inches</li>
<li><b><code>u_mi_km</code></b>: International miles to kilometers</li>
<li><b><code>u_km_mi</code></b>: kilometers to international miles</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-mjrProg" class="outline-2">
<h2 id="mjrProg"><span class="section-number-2">3.</span> Programs (<code>mjrProg/</code>)</h2>
<div class="outline-text-2" id="text-mjrProg">
<ul class="org-ul">
<li><b><code>jacobian</code></b>: Compute the Jacobin matrix of an expression</li>
<li><b><code>mkDmat</code></b>: Make a diagonal matrix from a list, matrix, or vector of elements</li>
<li><b><code>mkMat</code></b>: Make a diagonal matrix from an index expression</li>
</ul>
</div>
</div>

<div id="outline-container-mjrComp" class="outline-2">
<h2 id="mjrComp"><span class="section-number-2">4.</span> Computational eActivities (<code>mjrComp/</code>)</h2>
<div class="outline-text-2" id="text-mjrComp">
<p>
These are eActivities I saved off because they contain a general computational pattern I can reuse.
</p>

<ul class="org-ul">
<li><b><code>FunCrt1D</code></b>: Find the critical points of an expression in 1 variable</li>
<li><b><code>FunCrt2D</code></b>: Find the critical points of an expression in 2 variables</li>
<li><b><code>CubicInterp</code></b>: Cubic Interpolation between two points</li>
<li><b><code>LinearInterp</code></b>: Linear Interpolation between two points</li>
<li><b><code>SolveTri</code></b>: Solve triangles. I add cases as I encounter them, and so far I have ASA, SSS, SAS, &amp; AAS.</li>
</ul>
</div>
</div>

<div id="outline-container-org41f59f0" class="outline-2">
<h2 id="org41f59f0"><span class="section-number-2">5.</span> Formulas &amp; Equations eActivities (<code>mjrEqn/</code>)</h2>
<div class="outline-text-2" id="text-5">
<p>
These eActivities provide a reference &amp; computational environments for various formulas &amp; equations.
</p>

<ul class="org-ul">
<li><b><code>Diode</code></b>: Shockley Diode equation</li>
<li><b><code>CurrentDiv</code></b>: Current Divider</li>
<li><b><code>VoltageDiv</code></b>: Voltage Divider</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br />
<br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br />
<br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br />
<br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br />
<br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br />
</div>
</body>
</html>